ToolsBasedOnK8s/ExperimentResults/multiple-producer-1.txt
5000
24798 records sent, 4958.6 records/sec (4.73 MB/sec), 207.0 ms avg latency, 1097.0 ms max latency.
24382 records sent, 4876.4 records/sec (4.65 MB/sec), 86.5 ms avg latency, 297.0 ms max latency.
50000 records sent, 4870.920604 records/sec (4.65 MB/sec), 147.98 ms avg latency, 1097.00 ms max latency, 85 ms 50th, 484 ms 95th, 590 ms 99th, 686 ms 99.9th.

10000
41183 records sent, 8174.5 records/sec (7.80 MB/sec), 879.8 ms avg latency, 1780.0 ms max latency.
100000 records sent, 9324.009324 records/sec (8.89 MB/sec), 660.80 ms avg latency, 2152.00 ms max latency, 550 ms 50th, 1688 ms 95th, 2012 ms 99th, 2135 ms 99.9th.

20000
42022 records sent, 8355.9 records/sec (7.97 MB/sec), 1052.3 ms avg latency, 2139.0 ms max latency.
76104 records sent, 15196.5 records/sec (14.49 MB/sec), 3100.7 ms avg latency, 4720.0 ms max latency.
74693 records sent, 14879.1 records/sec (14.19 MB/sec), 3346.8 ms avg latency, 5551.0 ms max latency.
200000 records sent, 11135.857461 records/sec (10.62 MB/sec), 2878.20 ms avg latency, 7350.00 ms max latency, 2970 ms 50th, 4624 ms 95th, 7216 ms 99th, 7299 ms 99.9th.

30000
17017 records sent, 3361.7 records/sec (3.21 MB/sec), 925.8 ms avg latency, 2202.0 ms max latency.
52164 records sent, 10416.1 records/sec (9.93 MB/sec), 2682.0 ms avg latency, 3954.0 ms max latency.
39186 records sent, 7325.9 records/sec (6.99 MB/sec), 4141.5 ms avg latency, 7182.0 ms max latency.
19152 records sent, 3699.4 records/sec (3.53 MB/sec), 9489.9 ms avg latency, 11309.0 ms max latency.
19278 records sent, 3855.6 records/sec (3.68 MB/sec), 13086.0 ms avg latency, 15631.0 ms max latency.
29610 records sent, 5890.2 records/sec (5.62 MB/sec), 15451.7 ms avg latency, 18685.0 ms max latency.
12978 records sent, 2594.6 records/sec (2.47 MB/sec), 15741.1 ms avg latency, 21876.0 ms max latency.
25830 records sent, 5149.5 records/sec (4.91 MB/sec), 15115.9 ms avg latency, 19278.0 ms max latency.
17892 records sent, 3573.4 records/sec (3.41 MB/sec), 16355.3 ms avg latency, 19381.0 ms max latency.
23688 records sent, 3243.2 records/sec (3.09 MB/sec), 15651.4 ms avg latency, 19195.0 ms max latency.
19656 records sent, 3928.8 records/sec (3.75 MB/sec), 18918.3 ms avg latency, 22964.0 ms max latency.
21723 records sent, 4334.2 records/sec (4.13 MB/sec), 17405.2 ms avg latency, 20483.0 ms max latency.
300000 records sent, 4700.573470 records/sec (4.48 MB/sec), 10835.55 ms avg latency, 22964.00 ms max latency, 13132 ms 50th, 19196 ms 95th, 20645 ms 99th, 22261 ms 99.9th.