ToolsBasedOnK8s/ExperimentResults/multiple-producer-2-to-single-consumer.txt
49194 records sent, 9838.8 records/sec (9.38 MB/sec), 285.3 ms avg latency, 1770.0 ms max latency.
40948 records sent, 8188.0 records/sec (7.81 MB/sec), 205.1 ms avg latency, 1615.0 ms max latency.
59534 records sent, 11904.4 records/sec (11.35 MB/sec), 275.1 ms avg latency, 1587.0 ms max latency.
49807 records sent, 9947.5 records/sec (9.49 MB/sec), 51.1 ms avg latency, 182.0 ms max latency.
50288 records sent, 10057.6 records/sec (9.59 MB/sec), 100.5 ms avg latency, 398.0 ms max latency.
46583 records sent, 9316.6 records/sec (8.89 MB/sec), 1265.2 ms avg latency, 3515.0 ms max latency.
53413 records sent, 10682.6 records/sec (10.19 MB/sec), 117.9 ms avg latency, 682.0 ms max latency.
30764 records sent, 6136.8 records/sec (5.85 MB/sec), 655.3 ms avg latency, 2988.0 ms max latency.
37422 records sent, 7360.7 records/sec (7.02 MB/sec), 1714.2 ms avg latency, 3668.0 ms max latency.
47628 records sent, 9260.7 records/sec (8.83 MB/sec), 3649.8 ms avg latency, 5546.0 ms max latency.
48132 records sent, 9387.9 records/sec (8.95 MB/sec), 3244.0 ms avg latency, 5696.0 ms max latency.
38682 records sent, 7629.6 records/sec (7.28 MB/sec), 4990.5 ms avg latency, 7122.0 ms max latency.
77994 records sent, 15549.0 records/sec (14.83 MB/sec), 4967.2 ms avg latency, 9249.0 ms max latency.
73979 records sent, 14795.8 records/sec (14.11 MB/sec), 840.5 ms avg latency, 4634.0 ms max latency.
49961 records sent, 9992.2 records/sec (9.53 MB/sec), 87.5 ms avg latency, 374.0 ms max latency.
50257 records sent, 10047.4 records/sec (9.58 MB/sec), 57.0 ms avg latency, 259.0 ms max latency.
49986 records sent, 9957.4 records/sec (9.50 MB/sec), 106.3 ms avg latency, 398.0 ms max latency.
48642 records sent, 9720.6 records/sec (9.27 MB/sec), 86.0 ms avg latency, 308.0 ms max latency.
51653 records sent, 10330.6 records/sec (9.85 MB/sec), 75.5 ms avg latency, 304.0 ms max latency.
49627 records sent, 9901.6 records/sec (9.44 MB/sec), 121.2 ms avg latency, 679.0 ms max latency.
49193 records sent, 9830.7 records/sec (9.38 MB/sec), 51.4 ms avg latency, 308.0 ms max latency.
33758 records sent, 6115.6 records/sec (5.83 MB/sec), 92.6 ms avg latency, 2252.0 ms max latency.
72507 records sent, 14501.4 records/sec (13.83 MB/sec), 2112.7 ms avg latency, 4711.0 ms max latency.
50144 records sent, 10026.8 records/sec (9.56 MB/sec), 75.8 ms avg latency, 340.0 ms max latency.
47506 records sent, 9501.2 records/sec (9.06 MB/sec), 66.9 ms avg latency, 291.0 ms max latency.
51996 records sent, 10399.2 records/sec (9.92 MB/sec), 710.1 ms avg latency, 2151.0 ms max latency.
49311 records sent, 9822.9 records/sec (9.37 MB/sec), 92.1 ms avg latency, 355.0 ms max latency.
51537 records sent, 10307.4 records/sec (9.83 MB/sec), 84.0 ms avg latency, 494.0 ms max latency.
49415 records sent, 9672.1 records/sec (9.22 MB/sec), 106.5 ms avg latency, 399.0 ms max latency.
51704 records sent, 10340.8 records/sec (9.86 MB/sec), 82.6 ms avg latency, 338.0 ms max latency.
47808 records sent, 9550.1 records/sec (9.11 MB/sec), 41.6 ms avg latency, 242.0 ms max latency.
40815 records sent, 6268.6 records/sec (5.98 MB/sec), 64.3 ms avg latency, 2641.0 ms max latency.
21819 records sent, 3920.8 records/sec (3.74 MB/sec), 3038.9 ms avg latency, 8247.0 ms max latency.
106969 records sent, 21393.8 records/sec (20.40 MB/sec), 3595.4 ms avg latency, 9506.0 ms max latency.
53503 records sent, 10700.6 records/sec (10.20 MB/sec), 47.8 ms avg latency, 452.0 ms max latency.
39287 records sent, 7053.3 records/sec (6.73 MB/sec), 48.5 ms avg latency, 941.0 ms max latency.
4218 records sent, 711.5 records/sec (0.68 MB/sec), 418.0 ms avg latency, 7725.0 ms max latency.
116894 records sent, 23378.8 records/sec (22.30 MB/sec), 4099.7 ms avg latency, 8213.0 ms max latency.
54564 records sent, 10910.6 records/sec (10.41 MB/sec), 86.6 ms avg latency, 1319.0 ms max latency.
50112 records sent, 10022.4 records/sec (9.56 MB/sec), 154.7 ms avg latency, 1069.0 ms max latency.
48169 records sent, 9606.9 records/sec (9.16 MB/sec), 63.2 ms avg latency, 295.0 ms max latency.
51505 records sent, 10301.0 records/sec (9.82 MB/sec), 43.9 ms avg latency, 261.0 ms max latency.
50050 records sent, 10010.0 records/sec (9.55 MB/sec), 107.1 ms avg latency, 515.0 ms max latency.
50263 records sent, 10050.6 records/sec (9.58 MB/sec), 59.2 ms avg latency, 419.0 ms max latency.
49899 records sent, 9942.0 records/sec (9.48 MB/sec), 42.0 ms avg latency, 250.0 ms max latency.
50311 records sent, 10062.2 records/sec (9.60 MB/sec), 112.5 ms avg latency, 658.0 ms max latency.
50056 records sent, 10009.2 records/sec (9.55 MB/sec), 88.5 ms avg latency, 466.0 ms max latency.
49838 records sent, 9963.6 records/sec (9.50 MB/sec), 116.0 ms avg latency, 559.0 ms max latency.
50274 records sent, 10054.8 records/sec (9.59 MB/sec), 55.6 ms avg latency, 415.0 ms max latency.
49281 records sent, 8842.8 records/sec (8.43 MB/sec), 57.1 ms avg latency, 652.0 ms max latency.
56382 records sent, 11238.2 records/sec (10.72 MB/sec), 165.7 ms avg latency, 811.0 ms max latency.
39268 records sent, 7475.3 records/sec (7.13 MB/sec), 74.0 ms avg latency, 1386.0 ms max latency.
63431 records sent, 12686.2 records/sec (12.10 MB/sec), 695.5 ms avg latency, 2855.0 ms max latency.
50102 records sent, 10020.4 records/sec (9.56 MB/sec), 53.3 ms avg latency, 297.0 ms max latency.
49993 records sent, 9998.6 records/sec (9.54 MB/sec), 35.7 ms avg latency, 153.0 ms max latency.
49992 records sent, 9998.4 records/sec (9.54 MB/sec), 76.3 ms avg latency, 800.0 ms max latency.
49977 records sent, 9995.4 records/sec (9.53 MB/sec), 47.6 ms avg latency, 374.0 ms max latency.
49941 records sent, 9972.2 records/sec (9.51 MB/sec), 48.3 ms avg latency, 288.0 ms max latency.
49958 records sent, 9987.6 records/sec (9.52 MB/sec), 31.9 ms avg latency, 141.0 ms max latency.
50225 records sent, 10045.0 records/sec (9.58 MB/sec), 58.6 ms avg latency, 453.0 ms max latency.
49781 records sent, 9956.2 records/sec (9.49 MB/sec), 92.4 ms avg latency, 465.0 ms max latency.
18385 records sent, 3136.3 records/sec (2.99 MB/sec), 46.1 ms avg latency, 4045.0 ms max latency.
9032 records sent, 1805.7 records/sec (1.72 MB/sec), 8379.3 ms avg latency, 8686.0 ms max latency.
131388 records sent, 26277.6 records/sec (25.06 MB/sec), 3145.8 ms avg latency, 8564.0 ms max latency.
49578 records sent, 9915.6 records/sec (9.46 MB/sec), 168.3 ms avg latency, 903.0 ms max latency.
50578 records sent, 10115.6 records/sec (9.65 MB/sec), 127.7 ms avg latency, 796.0 ms max latency.
49875 records sent, 9939.2 records/sec (9.48 MB/sec), 105.2 ms avg latency, 559.0 ms max latency.
50111 records sent, 9634.9 records/sec (9.19 MB/sec), 97.9 ms avg latency, 501.0 ms max latency.
50334 records sent, 10064.8 records/sec (9.60 MB/sec), 84.3 ms avg latency, 370.0 ms max latency.
51858 records sent, 10371.6 records/sec (9.89 MB/sec), 122.3 ms avg latency, 738.0 ms max latency.
48029 records sent, 9567.5 records/sec (9.12 MB/sec), 94.9 ms avg latency, 547.0 ms max latency.
50262 records sent, 9786.2 records/sec (9.33 MB/sec), 115.2 ms avg latency, 506.0 ms max latency.
33534 records sent, 6692.1 records/sec (6.38 MB/sec), 343.6 ms avg latency, 2089.0 ms max latency.
37011 records sent, 7342.0 records/sec (7.00 MB/sec), 1691.9 ms avg latency, 3792.0 ms max latency.
1008 records sent, 169.0 records/sec (0.16 MB/sec), 4920.9 ms avg latency, 8748.0 ms max latency.
9576 records sent, 1889.9 records/sec (1.80 MB/sec), 11677.3 ms avg latency, 13471.0 ms max latency.
38682 records sent, 7688.7 records/sec (7.33 MB/sec), 14431.9 ms avg latency, 15687.0 ms max latency.
93744 records sent, 18730.1 records/sec (17.86 MB/sec), 6310.3 ms avg latency, 15221.0 ms max latency.
84546 records sent, 16878.8 records/sec (16.10 MB/sec), 3807.9 ms avg latency, 4683.0 ms max latency.
83538 records sent, 16651.0 records/sec (15.88 MB/sec), 3916.8 ms avg latency, 5051.0 ms max latency.
80785 records sent, 16140.9 records/sec (15.39 MB/sec), 1504.3 ms avg latency, 4218.0 ms max latency.
52292 records sent, 10435.4 records/sec (9.95 MB/sec), 55.9 ms avg latency, 461.0 ms max latency.
19370 records sent, 3197.4 records/sec (3.05 MB/sec), 92.2 ms avg latency, 4048.0 ms max latency.
85928 records sent, 17161.6 records/sec (16.37 MB/sec), 2639.9 ms avg latency, 5870.0 ms max latency.
51865 records sent, 10360.6 records/sec (9.88 MB/sec), 349.0 ms avg latency, 1640.0 ms max latency.
50589 records sent, 10117.8 records/sec (9.65 MB/sec), 283.1 ms avg latency, 876.0 ms max latency.
53201 records sent, 10640.2 records/sec (10.15 MB/sec), 210.2 ms avg latency, 1045.0 ms max latency.
50011 records sent, 10002.2 records/sec (9.54 MB/sec), 39.5 ms avg latency, 196.0 ms max latency.
49864 records sent, 9972.8 records/sec (9.51 MB/sec), 47.5 ms avg latency, 274.0 ms max latency.
50077 records sent, 9983.5 records/sec (9.52 MB/sec), 92.7 ms avg latency, 521.0 ms max latency.
50150 records sent, 9794.9 records/sec (9.34 MB/sec), 73.1 ms avg latency, 374.0 ms max latency.
51011 records sent, 10202.2 records/sec (9.73 MB/sec), 108.8 ms avg latency, 713.0 ms max latency.
31406 records sent, 6147.2 records/sec (5.86 MB/sec), 858.6 ms avg latency, 2738.0 ms max latency.
68636 records sent, 13618.3 records/sec (12.99 MB/sec), 787.2 ms avg latency, 3408.0 ms max latency.
51606 records sent, 10321.2 records/sec (9.84 MB/sec), 68.9 ms avg latency, 373.0 ms max latency.
49821 records sent, 9964.2 records/sec (9.50 MB/sec), 139.9 ms avg latency, 541.0 ms max latency.
50264 records sent, 10050.8 records/sec (9.59 MB/sec), 69.4 ms avg latency, 447.0 ms max latency.
50053 records sent, 10010.6 records/sec (9.55 MB/sec), 74.4 ms avg latency, 450.0 ms max latency.
5000000 records sent, 9867.908181 records/sec (9.41 MB/sec), 1105.02 ms avg latency, 15687.00 ms max latency, 83 ms 50th, 5499 ms 95th, 13674 ms 99th, 15200 ms 99.9th.